return {
    ["skillbook_teaches"] = "\n(Обучает: %{skillName})",
    ["skillbook"] = "\n(Книга навыков)",
    ["page_description"] = "Этот мод добавляет подсказку, если это книга навыков.\n\n"..
        "Включите параметр \"Показать название навыка\", чтобы отображать навык, которому он обучает.",
    ["tooltip_options"] = "Параметры всплывающей подсказки",
    ["show_skill_name_label"] = "Показать название навыка",
    ["show_skill_name_description"] = "Если эта функция включена, во всплывающих подсказках будет "..
        "указано название навыка, которому обучает книга.\n"..
        "В противном случае, там будет просто написано \"Книга навыков\".",
}