return {
    bigFrame = {
        name = "Крупный",
        description = "Гуары крупного телосложения сильны и выносливы, но несколько неуклюжи. Они полезны в бою или для перевозки грузов.",
        effects = {
            strength = 10,
            endurance = 10,
            agility = -10,
            size = 10
        }
    },
    smallFrame = {
        name = "Мелкий",
        description = "Гуары небольшого размера быстры и ловки, но не очень сильны. Они хороши в разведке и из них получаются отличные воры.",
        effects = {
            agility = 10,
            speed = 10,
            strength = -10,
            size = -10
        }
    },
    clever = {
        name = "Умный",
        description = "Умные гуары обладают высоким интеллектом и быстро осваивают новые команды.",
        effects = {
            intelligence = 10,
        }
    },
    charming = {
        name = "Милый",
        description = "Милые гуары просто очаровательны, поэтому они прекрасно умеют очаровывать людей.",
        effects = {
            personality = 10,
        }
    },
    tough = {
        name = "Крепкий",
        description = "Крепкие гуары могут выдержать все испытания, что делает их очень полезными в бою.",
        effects = {
        endurance = 10,
        }
    },
    ripped = {
        name = "Выносливый",
        description = "Выносливые гуары сильны и могут нести гораздо большую ношу, чем обычные гуары.",
        effects = {
            strength = 10,
        }
    },
    devious = {
        name = "Коварный",
        description = "Коварные гуары очень проворны, что делает их идеальными ворами.",
        effects = {
            agility = 10,
        }
    },
}