local Mechanics = require('scripts.Completionist.mechanics')

local quests = {

	{
		id = "x32_MQ",
		name = "Судьба и Грезы",
		category = "Сад снов | Главные задания",
		subcategory = "Сад и Поле мертвецов",
		text = "Проследите за судьбой обреченного человека, полного решимости избежать своей участи."
	},
	{
		id = "x32_SideQ_Doors",
		name = "Потерянные следы",
		category = "Сад снов | Разное",
		subcategory = "Белые Скалы",
		text = "Помогите заблудшему духу найти свой путь."
	},
	{
		id = "x32_SideQ_Space",
		name = "Навязчивые мысли",
		category = "Сад снов | Разное",
		subcategory = "Белые Скалы",
		text = "Помогите заблудшему духу найти то, что он потерял.",
	},
	{
		id = "x32_SideQ_Duel",
		name = "Отголоски дуэли",
		category = "Сад снов | Разное",
		subcategory = "Белые Скалы",
		text = "Завершите забытый поединок.",
	},
	{
		id = "x32_SideQ_Zadavi",
		name = "Шатер Задави",
		category = "Сад снов | Разное",
		subcategory = "Последняя гавань",
		text = "Помогите Задави усовершенствовать его шатер.",
	},
	{
		id = "x32_SideQ_Zadavi2",
		name = "Подушки Задави",
		category = "Сад снов | Разное",
		subcategory = "Последняя гавань",
		text = "Помоги Задави обустроить его шатер.",
	},
	{
		id = "X32_MTMSummon",
		name = "Мораг Тонг: Вызов Грандмастера",
		category = "Задания фракций | Мораг Тонг",
		subcategory = "Монастырь Мефалы",
		text = "Что нужно Эно Хлаалу?",
	},
	{
		id = "X32_MTMHello",
		name = "Мораг Тонг: Монастырь Мефалы",
		category = "Задания фракций | Мораг Тонг",
		subcategory = "Монастырь Мефалы",
		text = "Найдите Мастера Искусного Убийства.",
	},
	{
		id = "X32_MTMWritOneSelf",
		name = "Мораг Тонг: Приказ на Рейнила Ондора",
		category = "Задания фракций | Мораг Тонг",
		subcategory = "Монастырь Мефалы",
		text = "Выполните приказ на Рейнила Ондора.",
	},
	{
		id = "X32_MTMWritOneStudents",
		name = "Мораг Тонг: Изучение тонкостей",
		category = "Задания фракций | Мораг Тонг",
		subcategory = "Монастырь Мефалы",
		text = "Распределите приказы среди учеников.",
	},
	{
		id = "X32_MTMWritTwoSelf",
		name = "Мораг Тонг: Приказ на Касила Шепарда",
		category = "Задания фракций | Мораг Тонг",
		subcategory = "Монастырь Мефалы",
		text = "Выполните приказ на Касила Шепарда.",
	},
	{
		id = "X32_MTMWritTwoStudents",
		name = "Мораг Тонг: Постижение учений насилия",
		category = "Задания фракций | Мораг Тонг",
		subcategory = "Монастырь Мефалы",
		text = "Распределите приказы среди учеников.",
	},
	{
		id = "X32_MTMWritFinal",
		name = "Мораг Тонг: Уборка в доме",
		category = "Задания фракций | Мораг Тонг",
		subcategory = "Монастырь Мефалы",
		text = "Окончательное решение.",
	},
	{
		id = "x32_SideQ_MTMDuel",
		name = "Мораг Тонг: Восемнадцать золотых невезенья",
		category = "Задания фракций | Мораг Тонг",
		subcategory = "Монастырь Мефалы: Побочные задания",
		text = "Выполните поручение для брата и сестры Седрин.",
	},
	{
		id = "x32_SideQ_MTMNoble",
		name = "Мораг Тонг: Доставка",
		category = "Задания фракций | Мораг Тонг",
		subcategory = "Монастырь Мефалы: Побочные задания",
		text = "Доставьте посылку Фавила Ондора.",
	},

}

Mechanics.registerQuests(quests)
return true