---@class Ashfall.itemDescriptions
local itemDescriptions = {
    ashfall_firewood = "Топливо, используемое для костра." ,
    ashfall_bedroll = "Переносная кровать для сна на природе. Обеспечивает приличное тепло, но не защитит от дождя.",
    ashfall_bedroll_ashl = "Переносная кровать для сна на природе. Обеспечивает приличное тепло, но не защитит от дождя.",
    ashfall_cbroll_misc = "Переносная кровать с дождевиком. Согреет Вас и защитит от дождя, когда вы спите на открытом воздухе.",
    ashfall_woodaxe = "Железный топор для рубки дров. Массивный наконечник топора отличается высокой прочностью и позволяет заготавливать дрова гораздо быстрее, чем боевой топор." ,
    ashfall_woodaxe_steel = "Легкий стальной топор для рубки дров. Топорище отличается высокой прочностью и позволяет заготавливать дрова гораздо быстрее, чем боевой топор." ,

    --kettles
    ashfall_kettle = "Большой и тяжелый железный чайник. Используйте его для заваривания чая на огне." ,
    ashfall_kettle_01 = "Большой стальной чайник. Используйте для заваривания чая на огне." ,
    ashfall_kettle_02 = "Маленький, красивый керамический чайник. Можно использовать для заваривания чая на огне." ,
    ashfall_kettle_03 = "Эшлендерский синий чайник. Используйте для заваривания чая на огне." ,
    ashfall_kettle_04 = "Эшлендерский красный чайник. Используйте для заваривания чая на огне." ,
    ashfall_kettle_05 = "Редкий чайник неизвестного происхождения. Можно использовать для заваривания чая на огне." ,
    ashfall_kettle_06 = "Маленький простой чайник. Можно использовать для заваривания чая на огне." ,
    ashfall_kettle_07 = "Известковый чайник. Можно использовать для заваривания чая на огне." ,
    ashfall_kettle_08 = "Маленький традиционный чайник с деревянной ручкой. Можно использовать для заваривания чая на огне." ,
    ashfall_kettle_09 = "Маленький глиняный чайник. Можно использовать для заваривания чая на огне." ,

    --grills
    ashfall_grill = "Дешевый, тяжелый железный гриль. Используйте его для приготовления мяса и овощей на огне." ,
    ashfall_grill_steel = "Легкий стальной гриль. Используйте для приготовления мяса и овощей на огне." ,
    ashfall_fry_pan = "Небольшая железная сковорода. Используйте для приготовления мяса и овощей на огне." ,

    --cooking pots
    ashfall_cooking_pot = "Тяжелая медная кастрюля. Используйте, чтобы вскипятить воду и потушить мясо на огне." ,
    ashfall_cooking_pot_steel = "Легкая стальная кастрюля. Используйте, чтобы вскипятить воду и потушить мясо." ,
    ashfall_cooking_pot_iron = "Большая железная кастрюля. Используйте, чтобы вскипятить воду и потушить мясо." ,

    --backpacks
    ashfall_pack_01 = "Нордский рюкзак из коричневого меха." ,
    ashfall_pack_02 = "Нордский рюкзак из белого меха." ,
    ashfall_pack_03 = "Рюкзак из кожи нетча." ,
    ashfall_pack_04 = "Грубый рюкзак, увеличивает грузоподъемность.",
    ashfall_pack_05 = "Большой рюкзак с козырьком, прикрывающим от палящего солнца.",
    ashfall_pack_06 = "Маленький меховой рюкзак, согревает в пути",
    ashfall_pack_07 = "Небольшой плетеный рюкзак",
    --crab pot
    ashfall_crabpot_01_m = "Поместите в воду и ждите, чтобы поймать грязекрабов и собрать их мясо. Погрузите глубже под воду, в зоне, населенной грязевыми крабами, для лучшей ловли.",

    --Bushcrafting
    ashfall_rope = "Веревка, сплетенная из растительных волокон, которая может быть использована в более сложных ремесленных рецептах.",
    ashfall_straw = "Пучок соломы, который можно использовать в более сложных ремесленных рецептах.",
    ashfall_torch  = "Простейший факел, сделанный путем нанесения смолы на кусок дерева.",
    ashfall_fabric = "Кусок ткани, который можно использовать в более сложных ремесленных рецептах.",
    ashfall_cush_crft_01 = "Тканевая подушка, набитая соломой, на которой можно посидеть и скоротать время.",
    ashfall_strawhat = "Соломенная шляпа, защищающая владельца от солнца.",
    ashfall_waterskin = "Бурдюк для воды, сшитый из шкуры животного и покрытый водонепроницаемым слоем смолы.",
    ashfall_tent_leather_m = "Тяжелая палатка, сшитая из шкур различных животных.",
    ashfall_cov_thatch = "Навес для палатки из кожи и соломы. Прикрепите к палатке для обеспечения дополнительной защиты от осадков.",
    ashfall_cov_ashl = "Навес для палатки из кожи. Прикрепите к палатке для обеспечения дополнительной защиты от осадков.",
    ashfall_rug_crft_01 = "Простой коврик из ткани, который можно постелить на пол вашей палатки.",
    ashfall_leather = "Кусок кожи, изготовленный из дубленой шкуры животного.",
    ashfall_sack_01 = "Переносной мешок, можно использовать для хранения пробуктов",
    ashfall_fur_cloak = "Меховой плащ, поможет согреться",
    ashfall_fab_cloak = "Тонкий лоскутный плащ. Плохо согревает, но за то прост в изготовлении ",
    ashfall_workbench_01 = "Верстак. Позволяет создавать более сложные и прочные конструкции.",
    ashfall_satchel_01 = "Небольшая сумка для хранения ингредиентов.",
}
return itemDescriptions