
local cf = mwse.loadConfig("Nwah Randomizer", {en = true, m = false, m1 = false, den = 100, live = 5, chaos = false})
local p, D, AC, T	local B = {[0] = {}, [1] = {}}

local N = {cit = {"NM_npc_cit_1", "NM_npc_cit_2"}, pil = {"NM_npc_pil_1", "NM_npc_pil_2"}, red = {"NM_npc_redoran"}, slv = {"NM_npc_slv_1", "NM_npc_slv_2", "NM_npc_slv_3", "NM_npc_slv_4"},
citA = {"NM_npc_cit_A1", "NM_npc_cit_A2"}, tel = {"NM_npc_tel_1", "NM_npc_tel_2"}, fish = {"NM_npc_fisherman"}, TMora = {"NM_npc_tel_2", "NM_npc_cit_1"}, kalomnik = {"fargoth"}}

local C = {
["-2-9"] = {v = "cit", p = {{-10411,-71222,269}, {-11244,-70531,343,"fish"}, {-11563,-72049,233,"fish"}, {-11426,-68003,417}, {-8684,-69025,679}}}, -- Сейда Нин
["-3-3"] = {v = "cit", p = {{-21311,-16985,587}, {-23168,-16774,606}}},
["-3-2"] = {v = "cit", p = {{-23688,-15702,606}, {-22675,-15020,606}, {-22191,-12933,606}, {-24363,-12872,1062}, {-21209,-12593,444}, {-19718,-11734,262}, {-20111,-14147,283}, {-18520,-15154,283}, {-18510,-13828,270}, {-18064,-12205,283}, {-21900,-9886,852,"pil"}, {-22061,-8638,878,"pil"}, {-21763,-11090,590,"pil"}, {-17099,-15820,270, "cit"}, {-20353,-15861,262, "cit"}, {-17074,-13745,270}}},
["-2-2"] = {v = "cit", p = {{-15768,-13861,502}}},
["-4-2"] = {v = "cit", p = {{-25035,-11684,1162}}}, -- Балмора
["3-10"] = {v = "cit", p = {{29794,-77248,678}, {28095,-77341,678}, {24738,-81548,678}, {27532,-79672,3109}, {26934,-79403,678},{29895,-77635,1893}, {32531,-79959,1893}, {30016,-81851,1893}, {27243,-79815,1893}, {27571,-79805,3109}, {29173,-77651,1893,"pil"}, {26859,-78370,677,"pil"}, {29762,-77946,3109}, {29922,-77625,1893}, {26911,-79619,678,"pil"}, {30039,-77296,678}, {30063,-74779,638}, {32103,-78036,3109}}},
["4-10"] = {v = "cit", p = {{32853,-80304,678}, {32858,-77446,677,"pil"}}}, -- Вивек КЧ
["3-11"] = {v = "cit", p = {{28427,-89369,678}, {29505,-84449,678,"red"}, {32045,-88735,678}, {24712,-87219,678}, {32290,-89575,677,"pil"}, {26123,-86320,678}, {27322,-89377,678,"red"}, {24689,-84438,678}, {30376,-89005,1893}, {26201,-89250,678}, {30775,-89324,678}, {24636,-87297,678}, {32106,-85937,678,"pil"}, {32189,-84408,677}, {29172,-84834,1893}, {32145,-86973,678,"red"}, {31745,-86876,1893}, {29231,-89051,1893}, {26933,-86925,2044}, {27890,-84433,678}, {28826,-84444,678,"pil"}, {29927,-84779,1893,"pil"}, {26151,-86873,678}, {27753,-82167,678}, {30451,-82183,678}}}, -- Вивек Ред
["4-11"] = {v = "cit", p = {{34180,-89369,678}, {36387,-89319,678}, {39470,-89278,678}, {39535,-86367,678}, {38798,-84437,678,"pil"}, {36417,-84385,678}, {33508,-85299,678}, {36527,-84917,1894,"pil"}, {34043,-84793,1893}, {33879,-87217,1893}, {35287,-89024,1893}, {39188,-88401,1893}, {39210,-86417,1893,"slv"}, {37986,-85388,1358}, {40955,-86435,678,"tel"}, {35982,-84507,678}, {40943,-86266,678,"slv"}, {35232,-89309,678,"slv"}}}, -- Вивек Ар
["5-11"] = {v = "cit", p = {{43746,-87317,678,"tel"}, {45894,-84775,678,"tel"}, {42110,-86948,1893,"tel"}, {41362,-81939,1893}, {45396,-86929,1893,"slv"}, {45893,-86716,678,"slv"}, {41002,-84171,678}}},
["5-10"] = {v = "cit", p = {{45489,-81286,677,"tel"}, {45189,-81332,678,"slv"}, {45511,-81858,1893,"tel"}, {41276,-81753,1893,"slv"}, {41109,-81591,678,"tel"}}}, -- Вивек Телв
["2-10"] = {v = "cit", p = {{22538,-81331,677}, {23586,-81713,1893}}},
["2-11"] = {v = "cit", p = {{19795,-82385,678}, {19747,-86627,678}, {20101,-85688,1893}, {22237,-86999,1893}, {24304,-86458,1893}, {24296,-83119,1893,"pil"}}}, -- Вивек Хла
["3-12"] = {v = "cit", p = {{32047,-91010,678}, {29705,-90787,678}, {26256,-91001,678}, {26217,-93846,678}, {27486,-95754,678}, {29118,-95425,1893}, {26531,-94552,1893}, {27388,-91248,1893}, {30385,-91235,1893,"pil"}, {31790,-93644,1893,"pil"}, {30950,-97569,678}, {31510,-95708,678,"pil"}, {32082,-94377,678,"pil"}, {32110,-92559,678,"pil"}}}, -- Вивек ОД
["4-12"] = {v = "cit", p = {{33538,-94004,678}, {33608,-91387,678}, {35914,-90856,678}, {39430,-90958,678}, {39495,-93145,678}, {32896,-97826,740,"pil"}, {39090,-95804,678}, {34831,-98191,678}, {37115,-95449,1893}, {39199,-94890,1893}, {39046,-91169,1893}, {35059,-91198,1893,"pil"}, {33908,-93591,1893,"pil"}, {33720,-95754,678,"pil"}, {33509,-94249,677,"pil"}, {33565,-92369,678,"pil"}}}, -- Вивек ОО
["4-13"] = {v = "pil", p = {{32768,-99060,1156}, {34941,-99864,678}, {34927,-102041,678}, {33910,-103242,678}, {32836,-104113,870}, {33971,-101473,1156}}},
["3-13"] = {v = "pil", p = {{31788,-100852,1156}, {30665,-100139,678}, {30712,-102583,678}}},-- Вивек Храм
["2-13"] = {v = "cit", p = {{18466,-102289,423}, {19529,-102383,313}}},
["1-13"] = {v = "cit", p = {{15271,-101631,750}}}, -- Эбенгард
["6-6"] = {v = "cit", p = {{52904,-49130,636}}},
["6-7"] = {v = "cit", p = {{54169,-49780,278}, {53689,-50713,265}, {52826,-50974,275,"fish"}, {56263,-51399,917,"slv"}, {54051,-51535,275}, {56189,-55481,1365,"pil"}, {56186,-50162,581,"slv"}, {55803,-51061,630,"slv"}, {55656,-51195,630}, {55415,-52763,974}, {54196,-53920,982,"slv"}}}, -- Суран
["-1111"] = {v = "cit", p = {{-86742,90551,1118}, {-87399,92216,1036}, {-84382,92125,1110,"cit"}, {-83764,93434,1127}, {-86834,95835,1465}, {-83305,92021,1118}, {-85918,96522,1671}, {-84443,96507,1669,"pil"}, {-86672,93715,1119,"pil"}, {-87322,93091,1100,"pil"}, {-88599,94742,1156,"pil"}}},
["-1011"] = {v = "cit", p = {{-81316,94438,2286}, {-81265,93982,2234}, {-81717,90408,1081,"cit"}}}, -- Гнисис
["-916"] = {v = "fish", p = {{-66793,138654,323}}},
["-917"] = {v = "fish", p = {{-66665,140244,180}, {-68166,140486,214}, {-69182,142114,183}}},
["-816"] = {v = "cit", p = {{-65161,135755,1073}, {-65411,137521,772}}}, -- Хуул
["-83"] = {v = "fish", p = {{-58697,26589,183}, {-59314,27049,311}, {-60913,26337,334}, {-59508,28295,178}}}, -- Гнаар Мок
["-6-5"] = {v = "fish", p = {{-48356,-39690,183}, {-47927,-38856,311}, {-46776,-38156,253}}}, -- Хла Оуд
["722"] = {v = "fish", p = {{62667,183797,311}, {61927,182680,261}, {61750,182598,301,"cit"}, {60729,183483,302}, {60798,181788,624,"cit"}, {60165,180962,639,"cit"}, {59830,183425,362}, {59512,182022,484}}}, -- Дагон Фел
["1314"] = {v = "TMora", p = {{106965,117225,282}, {108355,118245,643}, {110189,119304,478}, {107548,121630,210}, {106970,120430,221}, {106831,118309,392}, {109439,118523,364}, {109555,116554,433}, {108329,117385,358}}}, -- Тель Мора
["1213"] = {v = "fish", p = {{99356,113755,328}}},
["1214"] = {v = "cit", p = {{98602,115067,834}}},
["1113"] = {v = "cit", p = {{97428,112885,258}}},
["1114"] = {v = "cit", p = {{92561,116683,1559}, {94031,116712,1756}, {95180,115622,1810,"tel"}, {96456,115441,1576}, {95193,116430,1973}}},
["1014"] = {v = "tel", p = {{88629,117973,3262}, {86850,118237,3550}, {85750,117577,3550}, {85674,118259,4760}, {87823,116927,4525}}}, -- Вос
["155"] = {v = "cit", p = {{124574,41581,254,"fish"}, {124583,43043,148}, {123327,44369,604,"tel"}, {123891,48470,869}, {126205,49108,1040,"tel"}, {126572,48415,851}, {126876,48029,771}, {126717,47345,759,"tel"}, {125279,46693,1160}, {125016,48079,831,"slv"}, {124498,48451,761,"slv"}}}, -- Тель Арун
["174"] = {v = "cit", p = {{142051,37517,309,"fish"}, {142186,36306,454,"fish"}, {146981,34295,712}, {144058,35849,437}, {146005,39289,725,"slv"}, {146277,39145,726,"slv"}, {146596,34745,617,"tel"}, {143530,35963,483,"slv"}, {145801,35964,655}, {146503,37656,914}, {146961,38820,718}, {146323,40564,876,"tel"}}},
["184"] = {v = "cit", p = {{148002,39083,786,"tel"}, {149013,39221,931}, {147861,39412,805,"slv"}, {147657,33314,473}, {150189,39492,947}, {151231,38856,684}, {148098,39099,798,"tel"}, {152340,38228,944,"slv"}, {152428,37201,1020,"tel"}, {152541,36246,820}, {152513,34755,905}, {151884,33525,939,"tel"}}},
["183"] = {v = "cit", p = {{151158,32488,945}, {150775,31539,730}, {147899,32668,457,"tel"}, {149507,31825,635}, {148290,32315,567}, {151803,30222,638}}},
["175"] = {v = "tel", p = {{146286,41034,927}, {145290,41815,787}}}, -- Садрит Мора
["14-13"] = {v = "fish", p = {{118999,-102725,392}, {119572,-103896,348}}},
["15-13"] = {v = "cit", p = {{124411,-105340,726}, {125454,-104108,541,"tel"}, {126148,-102860,795}, {125694,-102304,915,"tel"}, {126864,-101281,1281}, {127835,-102159,1819,"tel"}, {126719,-101529,2327}, {126413,-102757,854,"slv"}, {128107,-103306,562,"slv"}}}, -- Тель Бранора
["12-8"] = {v = "pil", p = {{104212,-58018,1518,"cit"}, {105208,-58225,1510}, {104519,-57543,1907}, {104288,-61115,751,"cit"}, {106345,-61819,870}}},
["13-8"] = {v = "pil", p = {{107718,-62515,678}, {109996,-64247,678,"cit"}, {111965,-64261,678}, {113617,-60738,678}, {112782,-59432,678,"slv"}, {110746,-59408,678}, {108032,-59454,678}, {110633,-59745,1893}, {108054,-59806,1893,"cit"}, {108044,-61930,1893,"cit"}, {108114,-63811,1893,"slv"}, {110738,-63992,1893}, {113135,-63958,1893,"cit"}, {112123,-62032,2149}, {110301,-62130,2149,"slv"}, {109245,-61540,2149,"cit"}}}, -- Молаг Мар
["-26"] = {v = "citA", p = {{-16301,54763,2149}, {-16309,53505,1944,"red"}, {-16465,52720,1926}, {-15514,52266,2132}, {-14599,52612,2198,"pil"}, {-13713,51960,2187}, {-12653,53315,2428,"red"}, {-12541,54336,2445}, {-11653,54309,2462,"pil"}, {-10575,54747,2451}, {-9600,55052,2757}, {-9109,54320,2716}, {-8893,53484,2448,"red"}, {-12464,54792,2429}, {-13955,55620,2461}, {-14876,55617,2462}, {-12541,56352,2652,"red"}, {-12636,57056,2683}, {-11859,57127,2686}}},
["-27"] = {v = "citA", p = {{-10730,57861,2693,"red"}, {-8974,57939,2655}}}, -- Альдрун
["-312"] = {v = "citA", p = {{-22402,101250,1886}, {-23608,101261,1691}, {-22380,101962,2073}, {-21702,103002,2074,"pil"}, {-20855,102895,2078}, {-21867,104288,2273,"red"}, {-22262,105040,2262}, {-20138,103293,2109}, {-19063,102962,2411,"red"}, {-18815,103652,2395,"pil"}, {-17416,103103,2487,"pil"}}}, -- Маар Ган
["-1115"] = {v = "fish", p = {{-83828,123293,1180,"red"}, {-84496,123905,1346,"red"}, {-85489,125160,979}, {-86205,126450,502}, {-86069,127787,269,"cit"}, {-87396,128314,252}, {-88122,127119,279}, {-88103,125767,407}}}, -- Альд Велоти
["24"] = {v = "pil", p = {{21409,34597,2084}, {20930,37326,1121}, {21449,38208,1230}, {20302,38584,1308,"red"}, {20726,39217,1366,"red"}}},
["25"] = {v = "red", p = {{20726,39217,1366}}}, -- Призр Врата
["-22"] = {v = "cit", p = {{-10369,17438,1342}, {-11437,18106,1342,"cit"}, {-10363,18875,1462}, {-10838,19755,1440}, {-11974,19941,1495,"cit"}, {-12885,20284,1638}, {-10229,18152,1394}, {-11216,20960,1749}, {-13348,21942,1614,"cit"}}}, -- Кальдера
["-31"] = {v = "cit", p = {{-21924,15558,1946}, {-22562,14060,1963}, {-20356,11499,1180,"slv"}, {-23068,12904,1710,"slv"}, {-23767,13431,1851}, {-23508,10552,1359}, {-22718,9886,1018}, {-20193,9844,1240,"slv"}, {-21838,9649,1073}, {-19921,9982,1280}, {-20137,11698,1236}, {-17670,9109,1649}}}, -- Кальдера Шахты
["0-7"] = {v = "cit", p = {{531,-56579,1383}, {1021,-56854,1448}, {1938,-56990,1570}, {3011,-57677,1564}, {3907,-55472,1733}, {5366,-55685,1774}, {5648,-56822,1774}, {1636,-54017,999}, {284,-52927,616}}}, -- Пелагиад
}


local function onCellChanged(e)	local c, r, max, spawn, new, pos	local st = tes3.getSimulationTimestamp()
local hour = tes3.worldController.hour.value	local live			if hour > 8 and hour < 19 then live = 20 - hour end
for _, cell in pairs(tes3.getActiveCells()) do c = cell.gridX .. cell.gridY		if C[c] then spawn = 0	max = #C[c].p
	for r in tes3.iterate(cell.actors) do if r.data.death then if st > r.data.death then r:disable()	mwscript.setDelete{reference = r} else spawn = spawn + 1 end end end	--r:disable()	mwscript.setDelete{reference = r}	r:delete()
	if live then
		if cf.den == 100 then
			new = max - spawn	if new > 0 then		for i = 1, new do pos = C[c].p[i]
				r = tes3.createReference{object = table.choice(N[pos[4] or C[c].v]), cell = cell, position = pos}	r.data.born = st	r.data.death = st + live
			end end
		else
			new = math.floor(max * cf.den/100) - spawn		if new > 0 then		for i = 1, new do pos = table.choice(C[c].p)
				r = tes3.createReference{object = table.choice(N[pos[4] or C[c].v]), cell = cell, position = pos}	r.data.born = st	r.data.death = st + live
			end end
		end
	end
	if cf.m and new > 0 then tes3.messageBox("%s %s  Type = %s  Max = %d   Spawned = %d", cell.id, c, C[c].v, max, new) end
end end
end		event.register("cellChanged", onCellChanged)


local function onBodyPartAssigned(e) local r = e.reference	local ind = e.index		if B[ind] and r.baseObject.id:find("NM_npc") and not e.object then
	if r.data["BP"..ind] then e.bodyPart = tes3.getObject(r.data["BP"..ind])
	else local race = r.object.race.id		local sex = r.object.female and "f" or "m"		local bp = table.choice(B[ind][race][sex])
		e.bodyPart = bp		r.data["BP"..ind] = bp.id		if cf.m1 then tes3.messageBox("%s  BP = %s = %s", r, ind, bp.id) end
	end
end end		event.register("bodyPartAssigned", onBodyPartAssigned)


local function onLoaded(e)	p = tes3.player		--if not tes3.player.data.NR then tes3.player.data.NR = {} end	D = tes3.player.data.NR
if cf.chaos then T = timer.start{duration = 20, iterations = -1, callback = function()	local c
	for _, cell in pairs(tes3.getActiveCells()) do c = cell.gridX .. cell.gridY		if C[c] and #C[c].p > 3 then	if cf.m then tes3.messageBox("%s  CHAOS!", cell.id) end
		for r in tes3.iterate(cell.actors) do
			if r.data.born and not r.mobile.isDead and not r.mobile.inCombat then tes3.setAITravel{reference = r, destination = table.choice(C[c].p)} end
		end
	end end
end} end
end		event.register("loaded", onLoaded)

--local function onKey()	tes3.messageBox([=[ %s ["%s"] {%d,%d,%d}]=], p.cell.id, p.cell.gridX .. p.cell.gridY, p.position.x, p.position.y, p.position.z+100)
--mwse.log([=[ %s ["%s"] {%d,%d,%d}]=], p.cell.id, p.cell.gridX .. p.cell.gridY, p.position.x, p.position.y, p.position.z+100) end		event.register("keyDown", onKey, {filter = 42})

local function registerModConfig()	local template = mwse.mcm.createTemplate("Nwah Randomizer")		template:saveOnClose("Nwah Randomizer", cf)	template:register()		local page = template:createPage()
page:createYesNoButton{label = "English language", variable = mwse.mcm.createTableVariable{id = "en", table = cf}}
page:createYesNoButton{label = cf.en and "Show messages" or "Показ сообщений", variable = mwse.mcm.createTableVariable{id = "m", table = cf}}
page:createYesNoButton{label = cf.en and "Show head messages" or "Показ сообщений о бошках", variable = mwse.mcm.createTableVariable{id = "m1", table = cf}}
page:createSlider{label = cf.en and "Population density as a percentage. If not equal to 100, then the method of randomly generating spawn points will be applied" or
"Плотность населения в процентах. Если не равна 100, то будет применен метод рандомной генерации точек спавна", min = 10, max = 500, step = 1, jump = 10, variable = mwse.mcm.createTableVariable{id = "den", table = cf}}
--page:createSlider{label = cf.en and "Lifetime of new NPCs (game hours)" or "Время жизни новых неписей в игровых часах", min = 1, max = 240, step = 1, jump = 6, variable = mwse.mcm.createTableVariable{id = "live", table = cf}}
page:createYesNoButton{label = cf.en and "Chaos Mode: NPCs walk randomly" or "Режим хаоса: неписи рандомно ходят", variable = mwse.mcm.createTableVariable{id = "chaos", table = cf}}
end		event.register("modConfigReady", registerModConfig)

local function initialized(e)
for race in tes3.iterate(tes3.getDataHandler().nonDynamicData.races) do B[0][race.id] = {m={}, f={}}	 B[1][race.id] = {m={}, f={}} end
for bp in tes3.iterateObjects(1497648962) do if bp.partType == 0 and B[bp.part] and not bp.playable and bp.sourceMod == "Morrowind.esm" then table.insert(B[bp.part][bp.raceName][bp.female and "f" or "m"], bp) end end
end		event.register("initialized", initialized)