return {
	["Description"] =
[[Заново реализует функцию снятия стрелы или болта с тетивы из Morrowind Code Patch, с более полной анимацией и дополнительной схемой управления. Теперь, после снятия с тетивы, не будет совершаться выстрел "без стрелы".

Особая благодарность Juidius, Remiros и Hrnchamd.
Создано Petethegoat.]],

    ["Instant"] = "Мгновенное снятие",
    ["InstantDescription"] = "При включении опции \"Мгновенное снятие\" нажатие кнопки \"Приготовить оружие\" мгновенно активирует анимацию снятия стрелы или болта с тетивы. За время анимации необходимо отпустить кнопку атаки, иначе, после завершения анимации, сразу же будет произведена подготовка к следующему выстрелу.\nЕсли опция отключена, то, для того чтобы снять стрелу или болт с тетивы, необходимо, удерживая кнопку \"Приготовить оружие\", отпустить кнопку атаки.",

    ["MCPPatch"] = [[Обнаружено и отключено исправление "снимаем с тетивы" из Morrowind Code Patch.
Это не проблема, но вы можете повторно запустить MCP и применить с отключенной опцией [Игровая механика, снимаем с тетивы], чтобы удалить это сообщение.]]
}